       IDENTIFICATION DIVISION.
         PROGRAM-ID. SIMPLE-INTEREST-PROGRAM.
         AUTHOR SIVA.
  
       ENVIRONMENT DIVISION.
         CONFIGURATION SECTION.
           SOURCE-COMPUTER. IBM-3278.
           OBJECT-COMPUTER. IBM-3278.
    
       DATA DIVISION.
         WORKING-STORAGE SECTION.
         01 PRINCIPLE_AMOUNT        PIC 9(7).
         01 RATE                    PIC 99V9.
         01 YEARS                   PIC 9(2).
         01 SIMPLE_INTEREST         PIC 9(8).

       PROCEDURE DIVISION.
           DISPLAY "SIMPLE INTREST PROGRAM RUNNNING...".
           ACCEPT PRINCIPLE_AMOUNT.
           ACCEPT RATE.
           ACCEPT YEARS.
    
           COMPUTE SIMPLE_INTEREST = PRINCIPLE_AMOUNT*RATE*YEARS.
    
           DISPLAY 'SIMPLE INTEREST :'SIMPLE_INTEREST.
    
           STOP RUN.
