//Z71108AA JOB (ACCT),'VSAMCOPY',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,TIME=(0,5)
//FILEINS  EXEC PGM=IDCAMS
//IN1      DD DSN=Z71108.SIVA.SEQ,DISP=SHR
//SYSIN    DD *
  REPRO INFILE(IN1) OUTDATASET(Z71108.SIVA.KSDS)
/*
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
